app/Controllers/Admin.php

SELECT *
FROM `usuarios`
WHERE `activo` = 1
---
    public function usuarios($activo = 1)
    {
        if (!isset($this->session->id_adm)) {
            return redirect()->to(base_url() . 'admin');
        }
        $usuario = $this->usuario->where('activo', $activo)->findAll();

SELECT `certificados`.`folio`, `certificados`.`fecha_alta`, `certificados`.`id_certificado`, `certificados`.`solicitud`, `certificados`.`curp_mascota`, `usuarios`.`id_usuario`, `usuarios`.`nombre` AS `usuario_nombre`, `usuarios`.`nombre_entidad`, `mascotas`.`nombre`, `mascotas`.`edad`, `mascotas`.`raza`, `mascotas`.`id_mascota`, `mascotas`.`especie`, `mascotas`.`esterilizado`, `mascotas`.`sexo`, `mascotas`.`vacunado`
FROM `certificados`
LEFT JOIN `usuarios` ON `certificados`.`id_usuario` = `usuarios`.`id_usuario`
LEFT JOIN `mascotas` ON `certificados`.`id_mascota` = `mascotas`.`id_mascota`
WHERE `certificados`.`activo` = 1
---
    public function certificados($activo = 1)
    {
        if (!isset($this->session->id_adm)) {
            return redirect()->to(base_url() . 'admin');
        }
        $query = $this->certificado->db->table('certificados')
            ->select('certificados.folio, certificados.fecha_alta, certificados.id_certificado, certificados.solicitud, certificados.curp_mascota')
            ->select('usuarios.id_usuario, usuarios.nombre AS usuario_nombre, usuarios.nombre_entidad')
            ->select('mascotas.nombre, mascotas.edad, mascotas.raza, mascotas.id_mascota, mascotas.especie, mascotas.esterilizado, mascotas.sexo, mascotas.vacunado')
            ->join('usuarios', 'certificados.id_usuario = usuarios.id_usuario', 'left')
            ->join('mascotas', 'certificados.id_mascota = mascotas.id_mascota', 'left')
            ->where('certificados.activo', $activo)
            ->get();

SELECT `temporal`.`id_mascota`, `temporal`.`id_usuario`, `temporal`.`id_temp`, `temporal`.`numero_solicitud`, `temporal`.`curp_mascota`, `usuarios`.`id_usuario`, `usuarios`.`nombre` AS `usuario_nombre`, `id_temp`, `usuarios`.`cve_entidad`, `usuarios`.`correo`, `mascotas`.`nombre`, `mascotas`.`edad`, `mascotas`.`raza`, `mascotas`.`id_mascota`
FROM `temporal`
LEFT JOIN `usuarios` ON `temporal`.`id_usuario` = `usuarios`.`id_usuario`
LEFT JOIN `mascotas` ON `temporal`.`id_mascota` = `mascotas`.`id_mascota`
WHERE `temporal`.`activo` = 1
---
    public function certificadosPendientes($activo = 1)
    {
        if (!isset($this->session->id_adm)) {
            return redirect()->to(base_url() . 'admin');
        }
        $query = $this->temporal->db->table('temporal')
            ->select('temporal.id_mascota, temporal.id_usuario, temporal.id_temp, temporal.numero_solicitud, temporal.curp_mascota')
            ->select('usuarios.id_usuario, usuarios.nombre AS usuario_nombre, id_temp, usuarios.cve_entidad, usuarios.correo')
            ->select('mascotas.nombre, mascotas.edad, mascotas.raza, mascotas.id_mascota')
            ->join('usuarios', 'temporal.id_usuario = usuarios.id_usuario', 'left')
            ->join('mascotas', 'temporal.id_mascota = mascotas.id_mascota', 'left')
            ->where('temporal.activo', $activo)
            ->get();

SELECT `usuarios`.`id_usuario`, `usuarios`.`nombre`, `usuarios`.`correo`, `usuarios`.`telefono`, `usuarios`.`nombre_entidad`, `usuarios`.`calle`, `usuarios`.`colonia`, `usuarios`.`numero`, `usuarios`.`cp`, `usuarios`.`activo`
FROM `usuarios`
WHERE `usuarios`.`activo` = 0
---
    public function usuariosPendientes($activo = 0)
    {
        if (!isset($this->session->id_adm)) {
            return redirect()->to(base_url() . 'admin');
        }
        $query = $this->usuario->db->table('usuarios')
            ->select('usuarios.id_usuario, usuarios.nombre, usuarios.correo, usuarios.telefono, usuarios.nombre_entidad, usuarios.calle, usuarios.colonia, usuarios.numero, usuarios.cp, usuarios.activo')
            ->where('usuarios.activo', $activo)
            ->get();

SELECT `usuarios`.`id_usuario`, `usuarios`.`nombre`, `usuarios`.`correo`, `usuarios`.`telefono`, `usuarios`.`nombre_entidad`, `usuarios`.`calle`, `usuarios`.`colonia`, `usuarios`.`numero`, `usuarios`.`cp`, `usuarios`.`activo`, `usuarios`.`id_entidad`, `usuarios`.`ruta_identificacion`, `usuarios`.`ruta_curp`, `usuarios`.`ruta_domicilio`
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '73'
---
    public function verDatosUsuario($id_usuario)
    {
        if (!isset($this->session->id_adm)) {
            return redirect()->to(base_url() . 'admin');
        }
        $query = $this->usuario->db->table('usuarios')
            ->select('usuarios.id_usuario, usuarios.nombre, usuarios.correo, usuarios.telefono, usuarios.nombre_entidad, usuarios.calle, usuarios.colonia, usuarios.numero, usuarios.cp, usuarios.activo, usuarios.id_entidad, usuarios.ruta_identificacion, usuarios.ruta_curp, usuarios.ruta_domicilio')
            ->where('usuarios.id_usuario', $id_usuario)
            ->get();

SELECT `usuarios`.`id_usuario`, `usuarios`.`nombre`, `usuarios`.`correo`, `usuarios`.`telefono`, `usuarios`.`nombre_entidad`, `usuarios`.`calle`, `usuarios`.`colonia`, `usuarios`.`numero`, `usuarios`.`cp`, `usuarios`.`activo`
FROM `usuarios`
WHERE `usuarios`.`activo` = 3
---
    public function usuariosEliminados($activo = 3)
    {
        $query = $this->usuario->db->table('usuarios')
            ->select('usuarios.id_usuario, usuarios.nombre, usuarios.correo, usuarios.telefono, usuarios.nombre_entidad, usuarios.calle, usuarios.colonia, usuarios.numero, usuarios.cp, usuarios.activo')
            ->where('usuarios.activo', $activo)
            ->get();

SELECT `certificados`.`folio`, `certificados`.`fecha_alta`, `certificados`.`id_certificado`, `certificados`.`solicitud`, `certificados`.`curp_mascota`, `usuarios`.`id_usuario`, `usuarios`.`nombre` AS `usuario_nombre`, `usuarios`.`nombre_entidad`, `usuarios`.`calle`, `usuarios`.`colonia`, `usuarios`.`numero`, `usuarios`.`cp`, `usuarios`.`cve_entidad`, `usuarios`.`telefono`, `usuarios`.`correo`, `mascotas`.`nombre`, `mascotas`.`edad`, `mascotas`.`raza`, `mascotas`.`id_mascota`, `mascotas`.`especie`, `mascotas`.`esterilizado`, `mascotas`.`sexo`, `mascotas`.`vacunado`, CONCAT(usuarios.calle, ' ', usuarios.numero, ', Col. ', usuarios.colonia, ', C.P. ', usuarios.cp, ', ', usuarios.nombre_entidad) AS direccion
FROM `certificados`
LEFT JOIN `usuarios` ON `certificados`.`id_usuario` = `usuarios`.`id_usuario`
LEFT JOIN `mascotas` ON `certificados`.`id_mascota` = `mascotas`.`id_mascota`
WHERE `certificados`.`activo` = 1
---
    public function exportarExcelCertificados($activo = 1)
    {
        if (!isset($this->session->id_adm)) {
            return redirect()->to(base_url() . 'admin');
        }

        $query = $this->certificado->db->table('certificados')
            ->select('certificados.folio, certificados.fecha_alta, certificados.id_certificado, certificados.solicitud, certificados.curp_mascota')
            ->select('usuarios.id_usuario, usuarios.nombre AS usuario_nombre, usuarios.nombre_entidad, usuarios.calle, usuarios.colonia, usuarios.numero, usuarios.cp, usuarios.cve_entidad, usuarios.telefono, usuarios.correo')
            ->select('mascotas.nombre, mascotas.edad, mascotas.raza, mascotas.id_mascota, mascotas.especie, mascotas.esterilizado, mascotas.sexo, mascotas.vacunado')
            ->select("CONCAT(usuarios.calle, ' ', usuarios.numero, ', Col. ', usuarios.colonia, ', C.P. ', usuarios.cp, ', ', usuarios.nombre_entidad) AS direccion", false)
            ->join('usuarios', 'certificados.id_usuario = usuarios.id_usuario', 'left')
            ->join('mascotas', 'certificados.id_mascota = mascotas.id_mascota', 'left')
            ->where('certificados.activo', $activo)
            ->get();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '71'
DELETE FROM `usuarios`
WHERE `id_usuario` IN ('71')
DELETE FROM `notificaciones`
WHERE `id_usuario` = '71'
---
    public function eliminarSolicitudUsuario($id_usuario)
    {
        if (!isset($this->session->id_adm)) {
            return redirect()->to(base_url() . 'admin');
        }
        $usuario = $this->usuario->find($id_usuario);
        if ($usuario) {
            $this->usuario->delete($id_usuario);
            $this->notificaciones->where('id_usuario', $id_usuario)->delete();